# Data Cleansing Exercise

Data Science Tasks: ![Overview of Data Science](https://miro.medium.com/v2/resize:fit:720/format:webp/1*bRA62jiJm8MbCPzWtXxPsQ.png)

[Exercise Source](https://towardsdatascience.com/data-cleaning-with-python-using-pandas-library-c6f4a68ea8eb)

## Step 1: Import Required Libraries (pandas, numpy, csv)

In [1]:
import pandas as pd
import numpy as np
import csv

## Step 2: Acquire Data Set
### For this exercise, we are using a home pricing prediction data set

In [9]:
df = pd.read_csv("C:/Users/Kevin Chung/Documents/IBM Data Science Cert/Module 2/housing_price_dataset.csv")
df.head(5)

   SquareFeet  Bedrooms  Bathrooms Neighborhood  YearBuilt          Price
0        2126         4          1        Rural       1969  215355.283618
1        2459         3          2        Rural       1980  195014.221626
2        1860         2          1       Suburb       1970  306891.012076
3        2294         2          1        Urban       1996  206786.787153
4        2130         5          2       Suburb       2001  272436.239065

## Step 3: Remove unused of irrelevant columns
### For this exercise, we will remove "Year Built"

In [11]:
to_drop =[
    'YearBuilt'
]

df.drop(to_drop, inplace = True, axis = 1)
df.head(5)

   SquareFeet  Bedrooms  Bathrooms Neighborhood          Price
0        2126         4          1        Rural  215355.283618
1        2459         3          2        Rural  195014.221626
2        1860         2          1       Suburb  306891.012076
3        2294         2          1        Urban  206786.787153
4        2130         5          2       Suburb  272436.239065

## Step 4: Rename Columns to Convenience

In [12]:
new_name = {
    'SquareFeet':'hSQ',
    'Bedrooms':'hBD',
    'Bathrooms':'hBR',
    'Neighborhood':'hArea',
    'Price':'hValue',
}

df.rename(columns = new_name, inplace = True)
df.head()

    hSQ  hBD  hBR   hArea         hValue
0  2126    4    1   Rural  215355.283618
1  2459    3    2   Rural  195014.221626
2  1860    2    1  Suburb  306891.012076
3  2294    2    1   Urban  206786.787153
4  2130    5    2  Suburb  272436.239065

## Step 5: Replace the Value of Rows if Necessary
### For purposes of this exercise, we will set Rural to 1, Suburb to 2, and Urban to 3

In [14]:
replace_values = {
    'Rural': 1,
    'Suburb': 2,
    'Urban': 3,
}

df = df.replace({"hArea" : replace_values})
df.head()

    hSQ  hBD  hBR  hArea         hValue
0  2126    4    1      1  215355.283618
1  2459    3    2      1  195014.221626
2  1860    2    1      2  306891.012076
3  2294    2    1      3  206786.787153
4  2130    5    2      2  272436.239065